In [1]:
import pandas as pd

In [2]:
XYZ_web={'Day':[1,2,3,4,5,6], "Visitors":[1000,700,6000,1000,400,350], 'Bounce_Rate':[20,20,23,15,10,34]}

In [3]:
df=pd.DataFrame(XYZ_web)

In [4]:
df

   Day  Visitors  Bounce_Rate
0    1      1000           20
1    2       700           20
2    3      6000           23
3    4      1000           15
4    5       400           10
5    6       350           34

In [5]:
df.head(2)

   Day  Visitors  Bounce_Rate
0    1      1000           20
1    2       700           20

In [8]:
df.tail(2)

   Day  Visitors  Bounce_Rate
4    5       400           10
5    6       350           34

In [10]:
df1=pd.DataFrame({"HPI":[80,90,70,60],"Int_rate":[2,1,2,3],"IND_GDP":[50,45,45,67]},
                index=[2001,2002,2003,2004])

In [11]:
df2=pd.DataFrame({"HPI":[80,90,70,60],"Int_rate":[2,1,2,3],"IND_GDP":[50,45,45,67]},
                index=[2005,2006,2007,2008])

In [12]:
merge=pd.merge(df1,df2)

In [13]:
merge

   HPI  Int_rate  IND_GDP
0   80         2       50
1   90         1       45
2   70         2       45
3   60         3       67

In [14]:
merge1=pd.merge(df1,df2, on="HPI")

In [15]:
merge1

   HPI  Int_rate_x  IND_GDP_x  Int_rate_y  IND_GDP_y
0   80           2         50           2         50
1   90           1         45           1         45
2   70           2         45           2         45
3   60           3         67           3         67

In [16]:
df1=pd.DataFrame({"Int_rate":[2,1,2,3],"IND_GDP":[50,45,45,67]},
                index=[2001,2002,2003,2004])

In [23]:
df2=pd.DataFrame({"Low_Tier_HPI":[50,45,45,67],"Unemployment":[1,3,5,6]},
                index=[2001,2003,2004,2004])

In [24]:
joined=df1.join(df2)

In [25]:
joined

      HPI  Int_rate  IND_GDP  Low_Tier_HPI  Unemployment
2001   80         2       50          50.0           1.0
2002   90         1       45           NaN           NaN
2003   70         2       45          45.0           3.0
2004   60         3       67          45.0           5.0
2004   60         3       67          67.0           6.0

In [29]:
df=pd.DataFrame({'Day':[1,2,3,4], "Visitors":[200,100,230,300], 'Bounce_Rate':[20,45,60,10]})

In [30]:
df

   Day  Visitors  Bounce_Rate
0    1       200           20
1    2       100           45
2    3       230           60
3    4       300           10

In [31]:
df.set_index("Day")

     Visitors  Bounce_Rate
Day
1         200           20
2         100           45
3         230           60
4         300           10

In [32]:
df

   Day  Visitors  Bounce_Rate
0    1       200           20
1    2       100           45
2    3       230           60
3    4       300           10

In [33]:
df.set_index("Day",inplace=True)

In [34]:
df

     Visitors  Bounce_Rate
Day
1         200           20
2         100           45
3         230           60
4         300           10

In [35]:
df=df.rename(columns={"Visitors":"Users"})

In [36]:
df

     Users  Bounce_Rate
Day
1      200           20
2      100           45
3      230           60
4      300           10

In [41]:
df1=pd.DataFrame({"HPI":[80,85,88,85],
                  "Int_rate":[2,3,2,2],
                  "IND_GDP_Thousends":[50,55,65,55]},
                index=[2001,2002,2003,2004])

In [42]:
df2=pd.DataFrame({"HPI":[80,85,88,85],
                  "Int_rate":[2,3,2,2],
                  "IND_GDP_Thousends":[50,55,65,55]},
                index=[2005,2006,2007,2008])

In [43]:
Concat=pd.concat([df1,df2])

In [44]:
Concat

      HPI  Int_rate  IND_GDP_Thousends
2001   80         2                 50
2002   85         3                 55
2003   88         2                 65
2004   85         2                 55
2005   80         2                 50
2006   85         3                 55
2007   88         2                 65
2008   85         2                 55